{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "816f5a4f",
   "metadata": {},
   "outputs": [],
   "source": [
    "from py2neo import Graph\n",
    "import pandas as pd\n",
    "graph = Graph(\"bolt://localhost:7687\", auth=(\"superman\", \"pizzapep\"))"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "68e463f5",
   "metadata": {},
   "source": [
    "# Building testing and training set"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ba34ff5f",
   "metadata": {},
   "source": [
    "## Training dataset"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 207,
   "id": "35c86083",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Find positive examples\n",
    "train_existing_links = graph.run(\"\"\"\n",
    "MATCH (n:Person)-[r:INTERACTS_1|INTERACTS_2|INTERACTS_3|INTERACTS_4|INTERACTS_5]-(p:Person)\n",
    "RETURN n.id AS node1, p.id AS node2, 1 AS label, r.season AS season\n",
    "\"\"\").to_data_frame()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 208,
   "id": "a40095af",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<class 'pandas.core.frame.DataFrame'>\n",
      "RangeIndex: 5360 entries, 0 to 5359\n",
      "Data columns (total 4 columns):\n",
      " #   Column  Non-Null Count  Dtype \n",
      "---  ------  --------------  ----- \n",
      " 0   node1   5360 non-null   object\n",
      " 1   node2   5360 non-null   object\n",
      " 2   label   5360 non-null   int64 \n",
      " 3   season  5360 non-null   int64 \n",
      "dtypes: int64(2), object(2)\n",
      "memory usage: 167.6+ KB\n"
     ]
    }
   ],
   "source": [
    "train_existing_links.info()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 209,
   "id": "bdbc6948",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Find negative examples\n",
    "train_missing_links = graph.run(\"\"\"\n",
    "MATCH (n:Person)\n",
    "WHERE (n:Person)-[:INTERACTS_1|INTERACTS_2|INTERACTS_3|INTERACTS_4|INTERACTS_5]-()\n",
    "MATCH (n:Person)-[r:INTERACTS_1|INTERACTS_2|INTERACTS_3|INTERACTS_4|INTERACTS_5*1..2]-(p:Person)\n",
    "WHERE not((n:Person)-[:INTERACTS_1|INTERACTS_2|INTERACTS_3|INTERACTS_4|INTERACTS_5]-(p:Person))\n",
    "RETURN n.id AS node1, p.id AS node2, 0 AS label\n",
    "\"\"\").to_data_frame()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 210,
   "id": "c11dccfa",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<class 'pandas.core.frame.DataFrame'>\n",
      "RangeIndex: 161350 entries, 0 to 161349\n",
      "Data columns (total 3 columns):\n",
      " #   Column  Non-Null Count   Dtype \n",
      "---  ------  --------------   ----- \n",
      " 0   node1   161350 non-null  object\n",
      " 1   node2   161350 non-null  object\n",
      " 2   label   161350 non-null  int64 \n",
      "dtypes: int64(1), object(2)\n",
      "memory usage: 3.7+ MB\n"
     ]
    }
   ],
   "source": [
    "train_missing_links.info()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 211,
   "id": "614d8eb1",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>node1</th>\n",
       "      <th>node2</th>\n",
       "      <th>label</th>\n",
       "      <th>season</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>ADDAM_MARBRAND</td>\n",
       "      <td>TYRION</td>\n",
       "      <td>0</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>ADDAM_MARBRAND</td>\n",
       "      <td>JAIME</td>\n",
       "      <td>0</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>ADDAM_MARBRAND</td>\n",
       "      <td>NED</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>ADDAM_MARBRAND</td>\n",
       "      <td>ROBERT</td>\n",
       "      <td>0</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>ADDAM_MARBRAND</td>\n",
       "      <td>SHAGGA</td>\n",
       "      <td>0</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "            node1   node2  label  season\n",
       "0  ADDAM_MARBRAND  TYRION      0       4\n",
       "1  ADDAM_MARBRAND   JAIME      0       3\n",
       "2  ADDAM_MARBRAND     NED      0       1\n",
       "3  ADDAM_MARBRAND  ROBERT      0       3\n",
       "4  ADDAM_MARBRAND  SHAGGA      0       3"
      ]
     },
     "execution_count": 211,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import random\n",
    "randomlist = []\n",
    "for i in range(0,161350):\n",
    "    n = random.randint(1,5)\n",
    "    randomlist.append(n)\n",
    "#print(randomlist)\n",
    "train_missing_links['season']=randomlist\n",
    "train_missing_links.head(5)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 212,
   "id": "f3352ae6",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Remove duplicates\n",
    "train_missing_links = train_missing_links.drop_duplicates()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 213,
   "id": "4c22a277",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<class 'pandas.core.frame.DataFrame'>\n",
      "Int64Index: 74240 entries, 0 to 161345\n",
      "Data columns (total 4 columns):\n",
      " #   Column  Non-Null Count  Dtype \n",
      "---  ------  --------------  ----- \n",
      " 0   node1   74240 non-null  object\n",
      " 1   node2   74240 non-null  object\n",
      " 2   label   74240 non-null  int64 \n",
      " 3   season  74240 non-null  int64 \n",
      "dtypes: int64(2), object(2)\n",
      "memory usage: 2.8+ MB\n"
     ]
    }
   ],
   "source": [
    "train_missing_links.info()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 214,
   "id": "158ad6ba",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Down sample negative examples\n",
    "train_missing_links = train_missing_links.sample(\n",
    "    n=len(train_existing_links))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 215,
   "id": "44bd107f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<class 'pandas.core.frame.DataFrame'>\n",
      "Int64Index: 5360 entries, 66329 to 122282\n",
      "Data columns (total 4 columns):\n",
      " #   Column  Non-Null Count  Dtype \n",
      "---  ------  --------------  ----- \n",
      " 0   node1   5360 non-null   object\n",
      " 1   node2   5360 non-null   object\n",
      " 2   label   5360 non-null   int64 \n",
      " 3   season  5360 non-null   int64 \n",
      "dtypes: int64(2), object(2)\n",
      "memory usage: 209.4+ KB\n"
     ]
    }
   ],
   "source": [
    "train_missing_links.info()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 216,
   "id": "42dd9ae1",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "C:\\Users\\aleks\\AppData\\Local\\Temp\\ipykernel_10388\\1256875715.py:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.\n",
      "  training_df = train_missing_links.append(\n"
     ]
    }
   ],
   "source": [
    "# Create DataFrame from positive and negative examples\n",
    "training_df = train_missing_links.append(\n",
    "    train_existing_links, ignore_index=True)\n",
    "training_df['label'] = training_df['label'].astype('category')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 217,
   "id": "219e32ba",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<class 'pandas.core.frame.DataFrame'>\n",
      "RangeIndex: 10720 entries, 0 to 10719\n",
      "Data columns (total 4 columns):\n",
      " #   Column  Non-Null Count  Dtype   \n",
      "---  ------  --------------  -----   \n",
      " 0   node1   10720 non-null  object  \n",
      " 1   node2   10720 non-null  object  \n",
      " 2   label   10720 non-null  category\n",
      " 3   season  10720 non-null  int64   \n",
      "dtypes: category(1), int64(1), object(2)\n",
      "memory usage: 262.0+ KB\n"
     ]
    }
   ],
   "source": [
    "training_df.info()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 218,
   "id": "3262ebd2",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>node1</th>\n",
       "      <th>node2</th>\n",
       "      <th>label</th>\n",
       "      <th>season</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>5360</th>\n",
       "      <td>ADDAM_MARBRAND</td>\n",
       "      <td>TYWIN</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5361</th>\n",
       "      <td>ADDAM_MARBRAND</td>\n",
       "      <td>LEO_LEFFORD</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5362</th>\n",
       "      <td>ADDAM_MARBRAND</td>\n",
       "      <td>KEVAN</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5363</th>\n",
       "      <td>AEGON</td>\n",
       "      <td>RHAENYRA</td>\n",
       "      <td>1</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5364</th>\n",
       "      <td>AEGON</td>\n",
       "      <td>MAESTER_AEMON</td>\n",
       "      <td>1</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10715</th>\n",
       "      <td>WAIF</td>\n",
       "      <td>THIN_MAN</td>\n",
       "      <td>1</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10716</th>\n",
       "      <td>WAIF</td>\n",
       "      <td>JAQEN</td>\n",
       "      <td>1</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10717</th>\n",
       "      <td>WAIF</td>\n",
       "      <td>ARYA</td>\n",
       "      <td>1</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10718</th>\n",
       "      <td>YOHN_ROYCE</td>\n",
       "      <td>LITTLEFINGER</td>\n",
       "      <td>1</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10719</th>\n",
       "      <td>YOHN_ROYCE</td>\n",
       "      <td>SANSA</td>\n",
       "      <td>1</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>5360 rows × 4 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                node1          node2 label  season\n",
       "5360   ADDAM_MARBRAND          TYWIN     1       1\n",
       "5361   ADDAM_MARBRAND    LEO_LEFFORD     1       1\n",
       "5362   ADDAM_MARBRAND          KEVAN     1       1\n",
       "5363            AEGON       RHAENYRA     1       5\n",
       "5364            AEGON  MAESTER_AEMON     1       5\n",
       "...               ...            ...   ...     ...\n",
       "10715            WAIF       THIN_MAN     1       5\n",
       "10716            WAIF          JAQEN     1       5\n",
       "10717            WAIF           ARYA     1       5\n",
       "10718      YOHN_ROYCE   LITTLEFINGER     1       5\n",
       "10719      YOHN_ROYCE          SANSA     1       5\n",
       "\n",
       "[5360 rows x 4 columns]"
      ]
     },
     "execution_count": 218,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#Checking if there are indeed labels with the positive category\n",
    "training_df[training_df['label'] == 1]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 219,
   "id": "2dcb449a",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>node1</th>\n",
       "      <th>node2</th>\n",
       "      <th>label</th>\n",
       "      <th>season</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>RAST</td>\n",
       "      <td>HOBB</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>ROBERT</td>\n",
       "      <td>STEELSHANKS_WALTON</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>ARYA</td>\n",
       "      <td>ARYA</td>\n",
       "      <td>0</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>DAISY</td>\n",
       "      <td>ROBB_DWARF</td>\n",
       "      <td>0</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>CRASTER</td>\n",
       "      <td>SHIREEN</td>\n",
       "      <td>0</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5355</th>\n",
       "      <td>GRENN</td>\n",
       "      <td>STEELSHANKS_WALTON</td>\n",
       "      <td>0</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5356</th>\n",
       "      <td>JON</td>\n",
       "      <td>MAREI</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5357</th>\n",
       "      <td>CATELYN</td>\n",
       "      <td>OSHA</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5358</th>\n",
       "      <td>POLLIVER</td>\n",
       "      <td>JOFFREY_DWARF</td>\n",
       "      <td>0</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5359</th>\n",
       "      <td>RHAENYS</td>\n",
       "      <td>MADAME</td>\n",
       "      <td>0</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>5360 rows × 4 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "         node1               node2 label  season\n",
       "0         RAST                HOBB     0       1\n",
       "1       ROBERT  STEELSHANKS_WALTON     0       1\n",
       "2         ARYA                ARYA     0       5\n",
       "3        DAISY          ROBB_DWARF     0       2\n",
       "4      CRASTER             SHIREEN     0       3\n",
       "...        ...                 ...   ...     ...\n",
       "5355     GRENN  STEELSHANKS_WALTON     0       5\n",
       "5356       JON               MAREI     0       1\n",
       "5357   CATELYN                OSHA     0       1\n",
       "5358  POLLIVER       JOFFREY_DWARF     0       3\n",
       "5359   RHAENYS              MADAME     0       5\n",
       "\n",
       "[5360 rows x 4 columns]"
      ]
     },
     "execution_count": 219,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#Checking if there are indeed labels with the negative category\n",
    "training_df[training_df['label'] == 0]"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f9df2220",
   "metadata": {},
   "source": [
    "## Testing dataset"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 295,
   "id": "73c1a51c",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Find positive examples\n",
    "test_existing_links = graph.run(\"\"\"\n",
    "MATCH (n:Person)-[r:INTERACTS_6|INTERACTS_7]-(p:Person)\n",
    "RETURN n.id AS node1, p.id AS node2, 1 AS label, r.season AS season\n",
    "\"\"\").to_data_frame()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 296,
   "id": "d4a076a1",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<class 'pandas.core.frame.DataFrame'>\n",
      "RangeIndex: 2044 entries, 0 to 2043\n",
      "Data columns (total 4 columns):\n",
      " #   Column  Non-Null Count  Dtype \n",
      "---  ------  --------------  ----- \n",
      " 0   node1   2044 non-null   object\n",
      " 1   node2   2044 non-null   object\n",
      " 2   label   2044 non-null   int64 \n",
      " 3   season  2044 non-null   int64 \n",
      "dtypes: int64(2), object(2)\n",
      "memory usage: 64.0+ KB\n"
     ]
    }
   ],
   "source": [
    "test_existing_links.info()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 297,
   "id": "4c45fdd1",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Find negative examples\n",
    "test_missing_links = graph.run(\"\"\"\n",
    "MATCH (n:Person)\n",
    "WHERE (n:Person)-[:INTERACTS_6|INTERACTS_7]-()\n",
    "MATCH (n:Person)-[r:INTERACTS_6|INTERACTS_7*1..2]-(p:Person)\n",
    "WHERE not((n:Person)-[:INTERACTS_6|INTERACTS_7]-(p:Person))\n",
    "RETURN n.id AS node1, p.id AS node2, 0 AS label\n",
    "\"\"\").to_data_frame()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 298,
   "id": "4685b2d8",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<class 'pandas.core.frame.DataFrame'>\n",
      "RangeIndex: 31608 entries, 0 to 31607\n",
      "Data columns (total 3 columns):\n",
      " #   Column  Non-Null Count  Dtype \n",
      "---  ------  --------------  ----- \n",
      " 0   node1   31608 non-null  object\n",
      " 1   node2   31608 non-null  object\n",
      " 2   label   31608 non-null  int64 \n",
      "dtypes: int64(1), object(2)\n",
      "memory usage: 740.9+ KB\n"
     ]
    }
   ],
   "source": [
    "test_missing_links.info()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 299,
   "id": "a023835a",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>node1</th>\n",
       "      <th>node2</th>\n",
       "      <th>label</th>\n",
       "      <th>season</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>AEGON</td>\n",
       "      <td>DAARIO</td>\n",
       "      <td>0</td>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>AEGON</td>\n",
       "      <td>BELICHO</td>\n",
       "      <td>0</td>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>AEGON</td>\n",
       "      <td>TYRION</td>\n",
       "      <td>0</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>AEGON</td>\n",
       "      <td>VALA</td>\n",
       "      <td>0</td>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>AEGON</td>\n",
       "      <td>RED_PRIEST</td>\n",
       "      <td>0</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   node1       node2  label  season\n",
       "0  AEGON      DAARIO      0       7\n",
       "1  AEGON     BELICHO      0       7\n",
       "2  AEGON      TYRION      0       6\n",
       "3  AEGON        VALA      0       7\n",
       "4  AEGON  RED_PRIEST      0       6"
      ]
     },
     "execution_count": 299,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "randomlist = []\n",
    "for i in range(0,31608):\n",
    "    n = random.randint(6,7)\n",
    "    randomlist.append(n)\n",
    "#print(randomlist)\n",
    "test_missing_links['season']=randomlist\n",
    "test_missing_links.head(5)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 300,
   "id": "047c7c91",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Remove duplicates \n",
    "test_missing_links = test_missing_links.drop_duplicates()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 301,
   "id": "046971b6",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<class 'pandas.core.frame.DataFrame'>\n",
      "Int64Index: 13813 entries, 0 to 31601\n",
      "Data columns (total 4 columns):\n",
      " #   Column  Non-Null Count  Dtype \n",
      "---  ------  --------------  ----- \n",
      " 0   node1   13813 non-null  object\n",
      " 1   node2   13813 non-null  object\n",
      " 2   label   13813 non-null  int64 \n",
      " 3   season  13813 non-null  int64 \n",
      "dtypes: int64(2), object(2)\n",
      "memory usage: 539.6+ KB\n"
     ]
    }
   ],
   "source": [
    "test_missing_links.info()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 302,
   "id": "0e972f60",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Down sample negative examples\n",
    "test_missing_links = test_missing_links.sample(n=len(test_existing_links))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 303,
   "id": "0441a663",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<class 'pandas.core.frame.DataFrame'>\n",
      "Int64Index: 2044 entries, 24090 to 23062\n",
      "Data columns (total 4 columns):\n",
      " #   Column  Non-Null Count  Dtype \n",
      "---  ------  --------------  ----- \n",
      " 0   node1   2044 non-null   object\n",
      " 1   node2   2044 non-null   object\n",
      " 2   label   2044 non-null   int64 \n",
      " 3   season  2044 non-null   int64 \n",
      "dtypes: int64(2), object(2)\n",
      "memory usage: 79.8+ KB\n"
     ]
    }
   ],
   "source": [
    "test_missing_links.info()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 304,
   "id": "0e050ec5",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "C:\\Users\\aleks\\AppData\\Local\\Temp\\ipykernel_10388\\957419439.py:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.\n",
      "  test_df = test_missing_links.append(\n"
     ]
    }
   ],
   "source": [
    "# Create DataFrame from positive and negative examples\n",
    "test_df = test_missing_links.append(\n",
    "    test_existing_links, ignore_index=True)\n",
    "test_df['label'] = test_df['label'].astype('category')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 305,
   "id": "7dce9883",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<class 'pandas.core.frame.DataFrame'>\n",
      "RangeIndex: 4088 entries, 0 to 4087\n",
      "Data columns (total 4 columns):\n",
      " #   Column  Non-Null Count  Dtype   \n",
      "---  ------  --------------  -----   \n",
      " 0   node1   4088 non-null   object  \n",
      " 1   node2   4088 non-null   object  \n",
      " 2   label   4088 non-null   category\n",
      " 3   season  4088 non-null   int64   \n",
      "dtypes: category(1), int64(1), object(2)\n",
      "memory usage: 100.1+ KB\n"
     ]
    }
   ],
   "source": [
    "test_df.info()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 306,
   "id": "951f7042",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>node1</th>\n",
       "      <th>node2</th>\n",
       "      <th>label</th>\n",
       "      <th>season</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>2044</th>\n",
       "      <td>AEGON</td>\n",
       "      <td>DAENERYS</td>\n",
       "      <td>1</td>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2045</th>\n",
       "      <td>AERYS</td>\n",
       "      <td>SANSA</td>\n",
       "      <td>1</td>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2046</th>\n",
       "      <td>AERYS</td>\n",
       "      <td>OLENNA</td>\n",
       "      <td>1</td>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2047</th>\n",
       "      <td>AERYS</td>\n",
       "      <td>NED</td>\n",
       "      <td>1</td>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2048</th>\n",
       "      <td>AERYS</td>\n",
       "      <td>VARYS</td>\n",
       "      <td>1</td>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4083</th>\n",
       "      <td>NED_UMBER</td>\n",
       "      <td>ALYS</td>\n",
       "      <td>1</td>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4084</th>\n",
       "      <td>QHONO</td>\n",
       "      <td>TYRION</td>\n",
       "      <td>1</td>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4085</th>\n",
       "      <td>QHONO</td>\n",
       "      <td>PODRICK</td>\n",
       "      <td>1</td>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4086</th>\n",
       "      <td>QHONO</td>\n",
       "      <td>HOUND</td>\n",
       "      <td>1</td>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4087</th>\n",
       "      <td>QHONO</td>\n",
       "      <td>BRIENNE</td>\n",
       "      <td>1</td>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>2044 rows × 4 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "          node1     node2 label  season\n",
       "2044      AEGON  DAENERYS     1       7\n",
       "2045      AERYS     SANSA     1       7\n",
       "2046      AERYS    OLENNA     1       7\n",
       "2047      AERYS       NED     1       7\n",
       "2048      AERYS     VARYS     1       7\n",
       "...         ...       ...   ...     ...\n",
       "4083  NED_UMBER      ALYS     1       7\n",
       "4084      QHONO    TYRION     1       7\n",
       "4085      QHONO   PODRICK     1       7\n",
       "4086      QHONO     HOUND     1       7\n",
       "4087      QHONO   BRIENNE     1       7\n",
       "\n",
       "[2044 rows x 4 columns]"
      ]
     },
     "execution_count": 306,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#Checking if there are indeed labels with the positive category\n",
    "test_df[test_df['label'] == 1]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 308,
   "id": "84f87b32",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>node1</th>\n",
       "      <th>node2</th>\n",
       "      <th>label</th>\n",
       "      <th>season</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>LYANNA_MORMONT</td>\n",
       "      <td>WAIF</td>\n",
       "      <td>0</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>AERYS</td>\n",
       "      <td>MYRCELLA</td>\n",
       "      <td>0</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>WAIF</td>\n",
       "      <td>JON</td>\n",
       "      <td>0</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>WUN_WUN</td>\n",
       "      <td>BRAN</td>\n",
       "      <td>0</td>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>NIGHT_KING</td>\n",
       "      <td>RED_PRIEST</td>\n",
       "      <td>0</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2039</th>\n",
       "      <td>TYCHO</td>\n",
       "      <td>QYBURN</td>\n",
       "      <td>0</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2040</th>\n",
       "      <td>LITTLEFINGER</td>\n",
       "      <td>HIGH_SPARROW</td>\n",
       "      <td>0</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2041</th>\n",
       "      <td>LYANNA</td>\n",
       "      <td>ARTHUR</td>\n",
       "      <td>0</td>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2042</th>\n",
       "      <td>MELISANDRE</td>\n",
       "      <td>YEZZAN</td>\n",
       "      <td>0</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2043</th>\n",
       "      <td>WHITE_WALKER</td>\n",
       "      <td>RICKON</td>\n",
       "      <td>0</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>2044 rows × 4 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "               node1         node2 label  season\n",
       "0     LYANNA_MORMONT          WAIF     0       6\n",
       "1              AERYS      MYRCELLA     0       6\n",
       "2               WAIF           JON     0       6\n",
       "3            WUN_WUN          BRAN     0       7\n",
       "4         NIGHT_KING    RED_PRIEST     0       6\n",
       "...              ...           ...   ...     ...\n",
       "2039           TYCHO        QYBURN     0       6\n",
       "2040    LITTLEFINGER  HIGH_SPARROW     0       6\n",
       "2041          LYANNA        ARTHUR     0       7\n",
       "2042      MELISANDRE        YEZZAN     0       6\n",
       "2043    WHITE_WALKER        RICKON     0       6\n",
       "\n",
       "[2044 rows x 4 columns]"
      ]
     },
     "execution_count": 308,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#Checking if there are indeed labels with the negative category\n",
    "test_df[test_df['label'] == 0]"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "436930c3",
   "metadata": {},
   "source": [
    "# Choosing Random Forest Classifier"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 234,
   "id": "23ac1e25",
   "metadata": {},
   "outputs": [],
   "source": [
    "from sklearn.ensemble import RandomForestClassifier\n",
    "classifier = RandomForestClassifier(n_estimators=30, max_depth=10, \n",
    "                                    random_state=0)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "3bbe4e8a",
   "metadata": {},
   "source": [
    "## Generating link prediction features"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 279,
   "id": "a216b3b2",
   "metadata": {},
   "outputs": [],
   "source": [
    "def apply_graphy_features(data, rel_type):\n",
    "    query = \"\"\"\n",
    "    UNWIND $pairs AS pair\n",
    "    MATCH (p1) WHERE p1.id = pair.node1\n",
    "    MATCH (p2) WHERE p2.id = pair.node2\n",
    "    RETURN pair.node1 AS node1,\n",
    "           pair.node2 AS node2,\n",
    "           gds.alpha.linkprediction.commonNeighbors(\n",
    "               p1, p2, {relationshipQuery: $relType}) AS cn,\n",
    "           gds.alpha.linkprediction.preferentialAttachment(\n",
    "               p1, p2, {relationshipQuery: $relType}) AS pa,\n",
    "           gds.alpha.linkprediction.totalNeighbors(\n",
    "               p1, p2, {relationshipQuery: $relType}) AS tn\n",
    "    \"\"\"\n",
    "    pairs = [{\"node1\": node1, \"node2\": node2}  for node1,node2 in data[[\"node1\", \"node2\"]].values.tolist()]\n",
    "    params = {\"pairs\": pairs, \"relType\": rel_type}\n",
    "    \n",
    "    features = graph.run(query, params).to_data_frame()\n",
    "    return pd.merge(data, features, on = [\"node1\", \"node2\"])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 237,
   "id": "aa2e1ad6",
   "metadata": {},
   "outputs": [],
   "source": [
    "train_season1 = training_df[training_df['season'] == 1]\n",
    "train_season2 = training_df[training_df['season'] == 2]\n",
    "train_season3 = training_df[training_df['season'] == 3]\n",
    "train_season4 = training_df[training_df['season'] == 4]\n",
    "train_season5 = training_df[training_df['season'] == 5]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 309,
   "id": "e039a451",
   "metadata": {
    "scrolled": true
   },
   "outputs": [],
   "source": [
    "test_season6 = test_df[test_df['season'] == 6]\n",
    "test_season7 = test_df[test_df['season'] == 7]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 311,
   "id": "14bec1bc",
   "metadata": {},
   "outputs": [],
   "source": [
    "train_season1_v = apply_graphy_features(train_season1, \"INTERACTS_1\")\n",
    "train_season2_v = apply_graphy_features(train_season2, \"INTERACTS_2\")\n",
    "train_season3_v= apply_graphy_features(train_season3, \"INTERACTS_3\")\n",
    "train_season4_v= apply_graphy_features(train_season4, \"INTERACTS_4\")\n",
    "train_season5_v= apply_graphy_features(train_season5, \"INTERACTS_5\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 312,
   "id": "b6600a29",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>node1</th>\n",
       "      <th>node2</th>\n",
       "      <th>label</th>\n",
       "      <th>season</th>\n",
       "      <th>cn</th>\n",
       "      <th>pa</th>\n",
       "      <th>tn</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>58</th>\n",
       "      <td>YARA</td>\n",
       "      <td>LITTLEFINGER</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>26.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2298</th>\n",
       "      <td>TYSHA</td>\n",
       "      <td>JAIME</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>1.0</td>\n",
       "      <td>48.0</td>\n",
       "      <td>25.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1387</th>\n",
       "      <td>CATELYN</td>\n",
       "      <td>AERYS</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>4.0</td>\n",
       "      <td>468.0</td>\n",
       "      <td>45.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>644</th>\n",
       "      <td>ALLISER_THORNE</td>\n",
       "      <td>GRENN</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>8.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>340</th>\n",
       "      <td>INNKEEPER</td>\n",
       "      <td>RORGE</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "               node1         node2 label  season   cn     pa    tn\n",
       "58              YARA  LITTLEFINGER     0       1  0.0    0.0  26.0\n",
       "2298           TYSHA         JAIME     1       1  1.0   48.0  25.0\n",
       "1387         CATELYN         AERYS     1       1  4.0  468.0  45.0\n",
       "644   ALLISER_THORNE         GRENN     0       1  0.0    0.0   8.0\n",
       "340        INNKEEPER         RORGE     0       1  0.0    0.0   0.0"
      ]
     },
     "execution_count": 312,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "train_season1_v.sample(5)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 323,
   "id": "2f3fbdc9",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<class 'pandas.core.frame.DataFrame'>\n",
      "Int64Index: 2177 entries, 0 to 8999\n",
      "Data columns (total 4 columns):\n",
      " #   Column  Non-Null Count  Dtype   \n",
      "---  ------  --------------  -----   \n",
      " 0   node1   2177 non-null   object  \n",
      " 1   node2   2177 non-null   object  \n",
      " 2   label   2177 non-null   category\n",
      " 3   season  2177 non-null   int64   \n",
      "dtypes: category(1), int64(1), object(2)\n",
      "memory usage: 70.3+ KB\n"
     ]
    }
   ],
   "source": [
    "###NOTE: AFTER APPLYING THE FUNCTION, NUMBER OF ROWS INCREASES! ==> why?\n",
    "train_season1.info()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 324,
   "id": "c2ac1414",
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<class 'pandas.core.frame.DataFrame'>\n",
      "Int64Index: 2392 entries, 0 to 2391\n",
      "Data columns (total 7 columns):\n",
      " #   Column  Non-Null Count  Dtype   \n",
      "---  ------  --------------  -----   \n",
      " 0   node1   2392 non-null   object  \n",
      " 1   node2   2392 non-null   object  \n",
      " 2   label   2392 non-null   category\n",
      " 3   season  2392 non-null   int64   \n",
      " 4   cn      2392 non-null   float64 \n",
      " 5   pa      2392 non-null   float64 \n",
      " 6   tn      2392 non-null   float64 \n",
      "dtypes: category(1), float64(3), int64(1), object(2)\n",
      "memory usage: 133.3+ KB\n"
     ]
    }
   ],
   "source": [
    "train_season1_v.info()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 313,
   "id": "b31122e8",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>node1</th>\n",
       "      <th>node2</th>\n",
       "      <th>label</th>\n",
       "      <th>season</th>\n",
       "      <th>cn</th>\n",
       "      <th>pa</th>\n",
       "      <th>tn</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>1705</th>\n",
       "      <td>SAM</td>\n",
       "      <td>QHORIN</td>\n",
       "      <td>1</td>\n",
       "      <td>2</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>9.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>729</th>\n",
       "      <td>SANSA</td>\n",
       "      <td>OBARA</td>\n",
       "      <td>0</td>\n",
       "      <td>2</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>19.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1967</th>\n",
       "      <td>FARLEN</td>\n",
       "      <td>RICKON</td>\n",
       "      <td>1</td>\n",
       "      <td>2</td>\n",
       "      <td>3.0</td>\n",
       "      <td>40.0</td>\n",
       "      <td>11.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>358</th>\n",
       "      <td>NYMERIA</td>\n",
       "      <td>PODRICK</td>\n",
       "      <td>0</td>\n",
       "      <td>2</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>11.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1308</th>\n",
       "      <td>DROGO</td>\n",
       "      <td>DAENERYS</td>\n",
       "      <td>1</td>\n",
       "      <td>2</td>\n",
       "      <td>1.0</td>\n",
       "      <td>26.0</td>\n",
       "      <td>14.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "        node1     node2 label  season   cn    pa    tn\n",
       "1705      SAM    QHORIN     1       2  0.0   0.0   9.0\n",
       "729     SANSA     OBARA     0       2  0.0   0.0  19.0\n",
       "1967   FARLEN    RICKON     1       2  3.0  40.0  11.0\n",
       "358   NYMERIA   PODRICK     0       2  0.0   0.0  11.0\n",
       "1308    DROGO  DAENERYS     1       2  1.0  26.0  14.0"
      ]
     },
     "execution_count": 313,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "train_season2_v.sample(5)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 314,
   "id": "b2ef7edd",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>node1</th>\n",
       "      <th>node2</th>\n",
       "      <th>label</th>\n",
       "      <th>season</th>\n",
       "      <th>cn</th>\n",
       "      <th>pa</th>\n",
       "      <th>tn</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>1553</th>\n",
       "      <td>PYCELLE</td>\n",
       "      <td>JOFFREY</td>\n",
       "      <td>1</td>\n",
       "      <td>3</td>\n",
       "      <td>10.0</td>\n",
       "      <td>273.0</td>\n",
       "      <td>24.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>326</th>\n",
       "      <td>BRIENNE</td>\n",
       "      <td>DORNISH_RIDER</td>\n",
       "      <td>0</td>\n",
       "      <td>3</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>5.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1100</th>\n",
       "      <td>DYING_MAN</td>\n",
       "      <td>LOMMY</td>\n",
       "      <td>0</td>\n",
       "      <td>3</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>736</th>\n",
       "      <td>HODOR</td>\n",
       "      <td>DAARIO</td>\n",
       "      <td>0</td>\n",
       "      <td>3</td>\n",
       "      <td>0.0</td>\n",
       "      <td>84.0</td>\n",
       "      <td>19.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>98</th>\n",
       "      <td>BRIENNE</td>\n",
       "      <td>RICKARD_STARK</td>\n",
       "      <td>0</td>\n",
       "      <td>3</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>5.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "          node1          node2 label  season    cn     pa    tn\n",
       "1553    PYCELLE        JOFFREY     1       3  10.0  273.0  24.0\n",
       "326     BRIENNE  DORNISH_RIDER     0       3   0.0    0.0   5.0\n",
       "1100  DYING_MAN          LOMMY     0       3   0.0    0.0   0.0\n",
       "736       HODOR         DAARIO     0       3   0.0   84.0  19.0\n",
       "98      BRIENNE  RICKARD_STARK     0       3   0.0    0.0   5.0"
      ]
     },
     "execution_count": 314,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "train_season3_v.sample(5)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 315,
   "id": "ce2e5ffc",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>node1</th>\n",
       "      <th>node2</th>\n",
       "      <th>label</th>\n",
       "      <th>season</th>\n",
       "      <th>cn</th>\n",
       "      <th>pa</th>\n",
       "      <th>tn</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>2187</th>\n",
       "      <td>MOUNTAIN</td>\n",
       "      <td>TYWIN</td>\n",
       "      <td>1</td>\n",
       "      <td>4</td>\n",
       "      <td>11.0</td>\n",
       "      <td>435.0</td>\n",
       "      <td>33.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>659</th>\n",
       "      <td>JANOS</td>\n",
       "      <td>RODRIK</td>\n",
       "      <td>0</td>\n",
       "      <td>4</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>13.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>202</th>\n",
       "      <td>MATTHOS</td>\n",
       "      <td>POLLIVER</td>\n",
       "      <td>0</td>\n",
       "      <td>4</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>6.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1514</th>\n",
       "      <td>ARYA</td>\n",
       "      <td>SALLY</td>\n",
       "      <td>1</td>\n",
       "      <td>4</td>\n",
       "      <td>2.0</td>\n",
       "      <td>75.0</td>\n",
       "      <td>26.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>355</th>\n",
       "      <td>WAYMAR_ROYCE</td>\n",
       "      <td>LANCEL</td>\n",
       "      <td>0</td>\n",
       "      <td>4</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "             node1     node2 label  season    cn     pa    tn\n",
       "2187      MOUNTAIN     TYWIN     1       4  11.0  435.0  33.0\n",
       "659          JANOS    RODRIK     0       4   0.0    0.0  13.0\n",
       "202        MATTHOS  POLLIVER     0       4   0.0    0.0   6.0\n",
       "1514          ARYA     SALLY     1       4   2.0   75.0  26.0\n",
       "355   WAYMAR_ROYCE    LANCEL     0       4   0.0    0.0   1.0"
      ]
     },
     "execution_count": 315,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "train_season4_v.sample(5)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 316,
   "id": "6811bead",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>node1</th>\n",
       "      <th>node2</th>\n",
       "      <th>label</th>\n",
       "      <th>season</th>\n",
       "      <th>cn</th>\n",
       "      <th>pa</th>\n",
       "      <th>tn</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>1833</th>\n",
       "      <td>MACE</td>\n",
       "      <td>JAQEN</td>\n",
       "      <td>1</td>\n",
       "      <td>5</td>\n",
       "      <td>4.0</td>\n",
       "      <td>70.0</td>\n",
       "      <td>13.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>604</th>\n",
       "      <td>QHORIN</td>\n",
       "      <td>OTHOR</td>\n",
       "      <td>0</td>\n",
       "      <td>5</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1217</th>\n",
       "      <td>ALLISER_THORNE</td>\n",
       "      <td>DENYS</td>\n",
       "      <td>1</td>\n",
       "      <td>5</td>\n",
       "      <td>0.0</td>\n",
       "      <td>33.0</td>\n",
       "      <td>14.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>874</th>\n",
       "      <td>ILLYRIO</td>\n",
       "      <td>MOUNTAIN</td>\n",
       "      <td>0</td>\n",
       "      <td>5</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>2.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>437</th>\n",
       "      <td>FENNESZ</td>\n",
       "      <td>TYRION</td>\n",
       "      <td>0</td>\n",
       "      <td>5</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>19.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "               node1     node2 label  season   cn    pa    tn\n",
       "1833            MACE     JAQEN     1       5  4.0  70.0  13.0\n",
       "604           QHORIN     OTHOR     0       5  0.0   0.0   0.0\n",
       "1217  ALLISER_THORNE     DENYS     1       5  0.0  33.0  14.0\n",
       "874          ILLYRIO  MOUNTAIN     0       5  0.0   0.0   2.0\n",
       "437          FENNESZ    TYRION     0       5  0.0   0.0  19.0"
      ]
     },
     "execution_count": 316,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "train_season5_v.sample(5)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 317,
   "id": "12cac1c1",
   "metadata": {},
   "outputs": [],
   "source": [
    "test_season6_v = apply_graphy_features(test_season6, 'INTERACTS_6')\n",
    "test_season7_v = apply_graphy_features(test_season7, \"INTERACTS_7\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 318,
   "id": "86314e1b",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>node1</th>\n",
       "      <th>node2</th>\n",
       "      <th>label</th>\n",
       "      <th>season</th>\n",
       "      <th>cn</th>\n",
       "      <th>pa</th>\n",
       "      <th>tn</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>2334</th>\n",
       "      <td>PODRICK</td>\n",
       "      <td>JAIME</td>\n",
       "      <td>1</td>\n",
       "      <td>6</td>\n",
       "      <td>4.0</td>\n",
       "      <td>250.0</td>\n",
       "      <td>31.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>833</th>\n",
       "      <td>LITTLEFINGER</td>\n",
       "      <td>WHITE_WALKER</td>\n",
       "      <td>0</td>\n",
       "      <td>6</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>11.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1901</th>\n",
       "      <td>NED</td>\n",
       "      <td>RODRIK</td>\n",
       "      <td>1</td>\n",
       "      <td>6</td>\n",
       "      <td>2.0</td>\n",
       "      <td>72.0</td>\n",
       "      <td>25.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2656</th>\n",
       "      <td>LYANNA_MORMONT</td>\n",
       "      <td>HARALD</td>\n",
       "      <td>1</td>\n",
       "      <td>6</td>\n",
       "      <td>6.0</td>\n",
       "      <td>70.0</td>\n",
       "      <td>11.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2199</th>\n",
       "      <td>DAVOS</td>\n",
       "      <td>ALLISER_THORNE</td>\n",
       "      <td>1</td>\n",
       "      <td>6</td>\n",
       "      <td>8.0</td>\n",
       "      <td>225.0</td>\n",
       "      <td>26.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "               node1           node2 label  season   cn     pa    tn\n",
       "2334         PODRICK           JAIME     1       6  4.0  250.0  31.0\n",
       "833     LITTLEFINGER    WHITE_WALKER     0       6  0.0    0.0  11.0\n",
       "1901             NED          RODRIK     1       6  2.0   72.0  25.0\n",
       "2656  LYANNA_MORMONT          HARALD     1       6  6.0   70.0  11.0\n",
       "2199           DAVOS  ALLISER_THORNE     1       6  8.0  225.0  26.0"
      ]
     },
     "execution_count": 318,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "test_season6_v.sample(5)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 319,
   "id": "469f51ce",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>node1</th>\n",
       "      <th>node2</th>\n",
       "      <th>label</th>\n",
       "      <th>season</th>\n",
       "      <th>cn</th>\n",
       "      <th>pa</th>\n",
       "      <th>tn</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>1477</th>\n",
       "      <td>JORAH</td>\n",
       "      <td>VARYS</td>\n",
       "      <td>1</td>\n",
       "      <td>7</td>\n",
       "      <td>11.0</td>\n",
       "      <td>418.0</td>\n",
       "      <td>30.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1205</th>\n",
       "      <td>BRONN</td>\n",
       "      <td>HOUND</td>\n",
       "      <td>1</td>\n",
       "      <td>7</td>\n",
       "      <td>11.0</td>\n",
       "      <td>384.0</td>\n",
       "      <td>29.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2229</th>\n",
       "      <td>YOHN_ROYCE</td>\n",
       "      <td>BRIENNE</td>\n",
       "      <td>1</td>\n",
       "      <td>7</td>\n",
       "      <td>10.0</td>\n",
       "      <td>312.0</td>\n",
       "      <td>28.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1482</th>\n",
       "      <td>JORAH</td>\n",
       "      <td>THOROS</td>\n",
       "      <td>1</td>\n",
       "      <td>7</td>\n",
       "      <td>5.0</td>\n",
       "      <td>154.0</td>\n",
       "      <td>24.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1617</th>\n",
       "      <td>MOUNTAIN</td>\n",
       "      <td>RANDYLL</td>\n",
       "      <td>1</td>\n",
       "      <td>7</td>\n",
       "      <td>5.0</td>\n",
       "      <td>160.0</td>\n",
       "      <td>21.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "           node1    node2 label  season    cn     pa    tn\n",
       "1477       JORAH    VARYS     1       7  11.0  418.0  30.0\n",
       "1205       BRONN    HOUND     1       7  11.0  384.0  29.0\n",
       "2229  YOHN_ROYCE  BRIENNE     1       7  10.0  312.0  28.0\n",
       "1482       JORAH   THOROS     1       7   5.0  154.0  24.0\n",
       "1617    MOUNTAIN  RANDYLL     1       7   5.0  160.0  21.0"
      ]
     },
     "execution_count": 319,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "test_season7_v.sample(5)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 327,
   "id": "6dc8f4e5",
   "metadata": {},
   "outputs": [],
   "source": [
    "#Combining all seasons for trainign set and testing set\n",
    "frames_training = [train_season1_v, train_season2_v, train_season3_v, train_season4_v, train_season5_v]\n",
    "result_training = pd.concat(frames_training)\n",
    "frames_test = [test_season6_v, test_season7_v]\n",
    "result_test = pd.concat(frames_test)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 328,
   "id": "25ed3273",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>node1</th>\n",
       "      <th>node2</th>\n",
       "      <th>label</th>\n",
       "      <th>season</th>\n",
       "      <th>cn</th>\n",
       "      <th>pa</th>\n",
       "      <th>tn</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>RAST</td>\n",
       "      <td>HOBB</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>7.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>ROBERT</td>\n",
       "      <td>STEELSHANKS_WALTON</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>36.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>NIGHT_KING</td>\n",
       "      <td>MANCE</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>JON</td>\n",
       "      <td>TOBHO_MOTT</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>1.0</td>\n",
       "      <td>52.0</td>\n",
       "      <td>27.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>YOREN</td>\n",
       "      <td>BRIENNE</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>16.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2790</th>\n",
       "      <td>TYENE</td>\n",
       "      <td>NYMERIA</td>\n",
       "      <td>1</td>\n",
       "      <td>5</td>\n",
       "      <td>5.0</td>\n",
       "      <td>42.0</td>\n",
       "      <td>8.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2791</th>\n",
       "      <td>TYENE</td>\n",
       "      <td>BRONN</td>\n",
       "      <td>1</td>\n",
       "      <td>5</td>\n",
       "      <td>5.0</td>\n",
       "      <td>84.0</td>\n",
       "      <td>14.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2792</th>\n",
       "      <td>WAIF</td>\n",
       "      <td>THIN_MAN</td>\n",
       "      <td>1</td>\n",
       "      <td>5</td>\n",
       "      <td>2.0</td>\n",
       "      <td>21.0</td>\n",
       "      <td>8.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2793</th>\n",
       "      <td>WAIF</td>\n",
       "      <td>JAQEN</td>\n",
       "      <td>1</td>\n",
       "      <td>5</td>\n",
       "      <td>2.0</td>\n",
       "      <td>21.0</td>\n",
       "      <td>8.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2794</th>\n",
       "      <td>WAIF</td>\n",
       "      <td>ARYA</td>\n",
       "      <td>1</td>\n",
       "      <td>5</td>\n",
       "      <td>2.0</td>\n",
       "      <td>39.0</td>\n",
       "      <td>14.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>13008 rows × 7 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "           node1               node2 label  season   cn    pa    tn\n",
       "0           RAST                HOBB     0       1  0.0   0.0   7.0\n",
       "1         ROBERT  STEELSHANKS_WALTON     0       1  0.0   0.0  36.0\n",
       "2     NIGHT_KING               MANCE     0       1  0.0   0.0   0.0\n",
       "3            JON          TOBHO_MOTT     0       1  1.0  52.0  27.0\n",
       "4          YOREN             BRIENNE     0       1  0.0   0.0  16.0\n",
       "...          ...                 ...   ...     ...  ...   ...   ...\n",
       "2790       TYENE             NYMERIA     1       5  5.0  42.0   8.0\n",
       "2791       TYENE               BRONN     1       5  5.0  84.0  14.0\n",
       "2792        WAIF            THIN_MAN     1       5  2.0  21.0   8.0\n",
       "2793        WAIF               JAQEN     1       5  2.0  21.0   8.0\n",
       "2794        WAIF                ARYA     1       5  2.0  39.0  14.0\n",
       "\n",
       "[13008 rows x 7 columns]"
      ]
     },
     "execution_count": 328,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "result_training"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 329,
   "id": "b3babb30",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>node1</th>\n",
       "      <th>node2</th>\n",
       "      <th>label</th>\n",
       "      <th>season</th>\n",
       "      <th>cn</th>\n",
       "      <th>pa</th>\n",
       "      <th>tn</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>LYANNA_MORMONT</td>\n",
       "      <td>WAIF</td>\n",
       "      <td>0</td>\n",
       "      <td>6</td>\n",
       "      <td>0.0</td>\n",
       "      <td>30.0</td>\n",
       "      <td>13.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>AERYS</td>\n",
       "      <td>MYRCELLA</td>\n",
       "      <td>0</td>\n",
       "      <td>6</td>\n",
       "      <td>0.0</td>\n",
       "      <td>3.0</td>\n",
       "      <td>4.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>WAIF</td>\n",
       "      <td>JON</td>\n",
       "      <td>0</td>\n",
       "      <td>6</td>\n",
       "      <td>0.0</td>\n",
       "      <td>99.0</td>\n",
       "      <td>36.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>NIGHT_KING</td>\n",
       "      <td>RED_PRIEST</td>\n",
       "      <td>0</td>\n",
       "      <td>6</td>\n",
       "      <td>0.0</td>\n",
       "      <td>15.0</td>\n",
       "      <td>8.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>BOWEN_MARSH</td>\n",
       "      <td>YOHN_ROYCE</td>\n",
       "      <td>0</td>\n",
       "      <td>6</td>\n",
       "      <td>0.0</td>\n",
       "      <td>30.0</td>\n",
       "      <td>13.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2402</th>\n",
       "      <td>NED_UMBER</td>\n",
       "      <td>ALYS</td>\n",
       "      <td>1</td>\n",
       "      <td>7</td>\n",
       "      <td>1.0</td>\n",
       "      <td>4.0</td>\n",
       "      <td>3.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2403</th>\n",
       "      <td>QHONO</td>\n",
       "      <td>TYRION</td>\n",
       "      <td>1</td>\n",
       "      <td>7</td>\n",
       "      <td>3.0</td>\n",
       "      <td>140.0</td>\n",
       "      <td>36.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2404</th>\n",
       "      <td>QHONO</td>\n",
       "      <td>PODRICK</td>\n",
       "      <td>1</td>\n",
       "      <td>7</td>\n",
       "      <td>3.0</td>\n",
       "      <td>76.0</td>\n",
       "      <td>20.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2405</th>\n",
       "      <td>QHONO</td>\n",
       "      <td>HOUND</td>\n",
       "      <td>1</td>\n",
       "      <td>7</td>\n",
       "      <td>3.0</td>\n",
       "      <td>96.0</td>\n",
       "      <td>25.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2406</th>\n",
       "      <td>QHONO</td>\n",
       "      <td>BRIENNE</td>\n",
       "      <td>1</td>\n",
       "      <td>7</td>\n",
       "      <td>3.0</td>\n",
       "      <td>104.0</td>\n",
       "      <td>27.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>5355 rows × 7 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "               node1       node2 label  season   cn     pa    tn\n",
       "0     LYANNA_MORMONT        WAIF     0       6  0.0   30.0  13.0\n",
       "1              AERYS    MYRCELLA     0       6  0.0    3.0   4.0\n",
       "2               WAIF         JON     0       6  0.0   99.0  36.0\n",
       "3         NIGHT_KING  RED_PRIEST     0       6  0.0   15.0   8.0\n",
       "4        BOWEN_MARSH  YOHN_ROYCE     0       6  0.0   30.0  13.0\n",
       "...              ...         ...   ...     ...  ...    ...   ...\n",
       "2402       NED_UMBER        ALYS     1       7  1.0    4.0   3.0\n",
       "2403           QHONO      TYRION     1       7  3.0  140.0  36.0\n",
       "2404           QHONO     PODRICK     1       7  3.0   76.0  20.0\n",
       "2405           QHONO       HOUND     1       7  3.0   96.0  25.0\n",
       "2406           QHONO     BRIENNE     1       7  3.0  104.0  27.0\n",
       "\n",
       "[5355 rows x 7 columns]"
      ]
     },
     "execution_count": 329,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "result_test"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "973aba67",
   "metadata": {},
   "source": [
    "## Train your model"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 330,
   "id": "04e2967a",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "RandomForestClassifier(max_depth=10, n_estimators=30, random_state=0)"
      ]
     },
     "execution_count": 330,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "columns = [\"cn\", \"pa\", \"tn\"]\n",
    "X = result_training[columns]\n",
    "y = result_training[\"label\"]\n",
    "classifier.fit(X, y)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5a971b98",
   "metadata": {},
   "source": [
    "# Evaluation"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 331,
   "id": "05879ce9",
   "metadata": {},
   "outputs": [],
   "source": [
    "from sklearn.metrics import recall_score\n",
    "from sklearn.metrics import precision_score\n",
    "from sklearn.metrics import accuracy_score\n",
    "def evaluate_model(predictions, actual):\n",
    "    accuracy = accuracy_score(actual, predictions)\n",
    "    precision = precision_score(actual, predictions)\n",
    "    recall = recall_score(actual, predictions)\n",
    "    \n",
    "    metrics = [\"accuracy\", \"precision\", \"recall\"]\n",
    "    values = [accuracy, precision, recall]    \n",
    "    return pd.DataFrame(data={'metric': metrics, 'value': values})\n",
    "def feature_importance(columns, classifier):        \n",
    "    features = list(zip(columns, classifier.feature_importances_))\n",
    "    sorted_features = sorted(features, key = lambda x: x[1]*-1)\n",
    "    \n",
    "    keys = [value[0] for value in sorted_features]\n",
    "    values = [value[1] for value in sorted_features]\n",
    "    return pd.DataFrame(data={'feature': keys, 'value': values})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 332,
   "id": "2119bf60",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>metric</th>\n",
       "      <th>value</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>accuracy</td>\n",
       "      <td>0.863119</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>precision</td>\n",
       "      <td>0.826268</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>recall</td>\n",
       "      <td>0.965674</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "      metric     value\n",
       "0   accuracy  0.863119\n",
       "1  precision  0.826268\n",
       "2     recall  0.965674"
      ]
     },
     "execution_count": 332,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "predictions = classifier.predict(result_test[columns])\n",
    "y_test = result_test[\"label\"]\n",
    "evaluate_model(predictions, y_test)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 333,
   "id": "ab5f37a8",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>feature</th>\n",
       "      <th>value</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>cn</td>\n",
       "      <td>0.463123</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>pa</td>\n",
       "      <td>0.381622</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>tn</td>\n",
       "      <td>0.155255</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  feature     value\n",
       "0      cn  0.463123\n",
       "1      pa  0.381622\n",
       "2      tn  0.155255"
      ]
     },
     "execution_count": 333,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "feature_importance(columns, classifier)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "065f3fa3",
   "metadata": {},
   "source": [
    "# Introducing more features (Triangles and The Clustering Coefficient)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "9b8fc14e",
   "metadata": {},
   "source": [
    "## Calculating the Triangle count"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "e0d66229",
   "metadata": {},
   "outputs": [],
   "source": [
    "query = \"\"\"\n",
    "CALL algo.triangleCount('Author', 'CO_AUTHOR_EARLY', { \n",
    "  write:true,\n",
    "  writeProperty:'trianglesTrain', \n",
    "  clusteringCoefficientProperty:'coefficientTrain'});\n",
    "\"\"\"\n",
    "graph.run(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "3daf127a",
   "metadata": {},
   "source": [
    "## Adding the features"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 334,
   "id": "e501626e",
   "metadata": {},
   "outputs": [],
   "source": [
    "def apply_triangles_features(data,triangles_prop,coefficient_prop):\n",
    "    query = \"\"\"\n",
    "    UNWIND $pairs AS pair\n",
    "    MATCH (p1) WHERE id(p1) = pair.node1\n",
    "    MATCH (p2) WHERE id(p2) = pair.node2\n",
    "    RETURN pair.node1 AS node1,\n",
    "    pair.node2 AS node2,\n",
    "    apoc.coll.min([p1[$triangles], p2[$triangles]]) AS minTriangles,\n",
    "    apoc.coll.max([p1[$triangles], p2[$triangles]]) AS maxTriangles,\n",
    "    apoc.coll.min([p1[$coefficient], p2[$coefficient]]) AS minCoeff,\n",
    "    apoc.coll.max([p1[$coefficient], p2[$coefficient]]) AS maxCoeff\n",
    "    \"\"\"\n",
    "    \n",
    "    pairs = [{\"node1\": pair[0], \"node2\": pair[1]}  \n",
    "          for pair in data[[\"node1\", \"node2\"]].values.tolist()]\n",
    "    params = {\"pairs\": pairs,\n",
    "              \"triangles\": triangles_prop,\n",
    "              \"coefficient\": coefficient_prop}\n",
    "    \n",
    "    features = graph.run(query, params).to_data_frame()\n",
    "    return pd.merge(data, features, on = [\"node1\", \"node2\"])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "b8719848",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "9d618600",
   "metadata": {},
   "outputs": [],
   "source": [
    "training_df = apply_triangles_features(training_df, \n",
    "  \"trianglesTrain\", \"coefficientTrain\")\n",
    "test_df = apply_triangles_features(test_df, \n",
    "  \"trianglesTest\", \"coefficientTest\")"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
